["\nThe broccoli-mushroom-chicken-wich is straight mcnastay. \n\nI kinda thought this might be the case going into it (but they swore that it was the best 1) - hence, I requested a lite smattering of the garlic cremen sauce. Came back smothered in cremen. eeew. Had to jettison the sandwich from my vehicle a short time later...which was the only fun thing I did today and the reason for the 5 stars.\n", "\nCame at 7:10pm on a Saturday, there weren't many people but that might also be b/c it's the Saturday before classes at uci start again.  Used the buy one 9\" combo and get a second 9\" 50% off deal to grab 4 sandwiches for the five of us. B/c we had to use cash for the deal, the sofas were also upgraded to large sizes.  I got the chicken bacon mushroom with garlic sauce!  Lovely and toasty bread, piping hot cheese, and the broccoli was tender.  My sister's absolute favorite for the past six years, she adores their garlic sauce and was so happy when they offered her some extra is sauce cups. The one thing that kinda got to me was the slightly dry chicken.  It's the biggest thing besides undercooked chicken that I hate.  B/c it was only slightly dry (and not to the point of sucking all the moisture out of my mouth like at the dentist) and the sauce and cheese helped out, it kinda lessened the blow.  If you like white pasta and garlic bread, this is probably the sandwich for you.  \nKinda sad that all of the croissants except for the butter ones were all gone, especially since they were advertised as \"any croissant $1\", but we came pretty close to their closing hour.\n\nFood 3.5/5\nService 5/5!\n", "\nI really like the Chicken Dijon sandwich here. Great flavors. \n\nI also tried the Chicken Cordonbleu. Pretty good, but flavors were a bit bland for me. \n\nOverall, great sandwich place. Friendly and efficient service.\n", "\n\"Triangular sandwiches taste better than square ones.\"  --Peter Kay\n\nThe hubs and I were up and about the area pretty early and needed a bite for breakfast.  We gave Le Diplomat a try over Peet's Coffee.  I'm a fan of La Vie en France bakery products and I noticed their signage indicating that they serve their products.  I decided on a Chicken Cordon Bleu Croissant and the hubs went with a Chicken Dijon sandwich.  \n\nMy croissant was alright.  The croissant itself was lovely, and had a standard slice of ham, some chunk chicken, and a slice of Swiss cheese melted between them.  \n\nThe hub's chicken dijon was good, but the sauce was rather salty and too rich. The butter was dripping out of the sandwich with every bite.  Don't get me wrong, we all love butter - but even this would make Paula Deen raise an eyebrow!\n", "\nFinally had a chance to come here. I was told the sandwich to get was the chicken mushroom broccoli so that's what I ordered. \n\nThe sandwich was pretty tasty. It was creamy and served hot. I chose to add the garlic sauce which was pretty tasty as well. \n\nNot sure how the other sandwiches hold up to the reviews but I'll definitely come back to try some more.\n", "\nI ALWAYS make a pit stop here whenever I'm in OC. \n\nI was first introduce to this little cafe one night when I was visiting my friend at UCI my freshman year of college and it CHANGED MY LIFE! \n\nMy friend and I would sometimes drive from UCR to UCI just to eat here (and visit my friends too I guess, mostly for the sandwich). \n\n*CHICKEN CORDON-BLEU w/extra GARLIC SAUCE! I've tried their other sandwiches, and this one tops it all. \n\nPS: Don't forget to get their Sriracha Sauce! Sooo good with their sandwiches.\n", "\nFinally had the chance to check this place out and it was everything I had hoped for! It's a pretty simple looking shop with counter service, which is perfectly fine since there's so many great seating options outside. Anyways, you know I had to check out their...\n\nChicken Mushroom Broccoli Sandwich - so delicious and messy to eat! Definitely grab your napkins for this one and don't forget to add some sriracha on there for that extra kick! The garlic sauce was soo yummy and all the ingredients paired perfectly. If I had gone to school here it would've definitely been a regular lunch spot for me. \n\nOverall, it's an affordable, quick, and delicious lunch spot. After you finish eating, you can walk it off through the Trader Joe's, Target, and other stores located in the plaza.\n", "\nLe Dip: one of UCI and the Irvine community's favorite places!\n\nChicken broccoli mushroom with that famed garlic sauce is a winner. I've also had a couple of their vegetarian options... Any of their sandwich creations on that famed French baguette is DELICIOUS.\n\nPeople drool over their sandwiches. I save it for whenever I want to treat myself.\n\nTheir drink options and smoothies are a nice addition as well. Chill day by UCI, this place never disappoints. In a plaza where big chain restaurants and starting to take over, it's no wonder our little Le Dip has survived. Their sandwiches are unbeatable.\n", "\nVery tasty sandwiches at a decent price. I especially like the chicken, broccoli, mushroom sandwich. Friendly and welcoming staff. Fast service. You must try it!\n", "\nSimple food. Simple price. DELICIOUS SANDWICHES!! \n\nLe dip is a go to place when you're hungry and on a budget. Always make sure to get extra garlic spread because it is one of a kind! Thank you Le Dip for feeding us hungry college students!\n", "\nReally really simple place, really really simple food, but really really good!\n\nWith a juicy 4.5 star average from over 1600 reviews to date, Le Dip seemed almost underwhelming at first glance - the shop was really small and didn't look too fancy or new, and the sandwiches everyone was raving about looked flat, sloppy, and...lacking.\n\nBut after giving the place a few tries, I began to understand why UCI students loved this place religiously.. It's fast, cheap, and just downright delicious. \n\nThe staff are super friendly and the quality of the food is consistently good. Every visit here has just been an absolute pleasure. \n\nA thorough review doesn't go without mentioning some negatives, so here they are - First of all, I personally stay away from the Vietnamese sandwiches because they're relatively plain and certainly not up to par with the authentic ones you get from local viet restaurants.. Stick with the classics, my favorites being the chicken broccoli mushroom and the bacon chicken club :)\n\n   Second, Le Dip kind of brands itself as a bakery/cafe. That being said, I would love to see them start taking their coffee game to the next level, because they've told me that things like their Vietnamese iced coffee are all pre-made, and as much as I love ordering it, it always comes out overly sweet.\n\nAll that being said, Le Dip has definitely been one of my college staples during my time at UCI, and will forever hold a special place in my heart :')\n", "\nStill the best place to go for sandwiches in Irvine hands down. ALL their sandwiches are delicious, but my go to back in the days was the chicken garlic, it's hot, bread grilled nicely, good amount of chicken, garlic sauce was amazing, and all of it went together great after dumping sriracha to add some spiciness to it. \n\nStaff was always nice and helpful. Food is prepared quick. There's plenty of parking in the lot, if you live in irvine or go to school at uci across the street, best place to go anytime of the day! I am so happy this place is still around considering the UTC has changed quite a bit.\n\nSwore i wrote a review of this place a long time ago, guess not, just go here!\n", "\nDelicious sandwiches and not pretentious little place.  Love it! \n\nThe pricing is amazing but this is because of the cafe's proximity to a university.  \n\nThis place feeds starving students as well as young professionals who want to stop in and grab a well-made sandwich.\n", "\nBack in the UCI days, this was the place to be!  The best thing- the chicken, mushroom, and broccoli sandwich.  Yes!  Nice, little plaza at UTC, which has looked nicer over the decades.\n", "\nI haven't been here in awhile and the chicken brocolli mushroom sandwich with extra garlic sauce is just as I remembered.  Did the price drop?  It's only $6.75 for a large sandwich.  People here are super nice, will be back again and again!\n", "\nSmall unassuming shop in the middle of the university towncenter.  Sandwhiches are excellent, and reasonably priced.  The bread is awesome and the service was great.  Definitely one of the better values in this plaza.\n", "\nThis place never disappoint. Is always good and delicious. I am always here if I am around the area. What are you waiting for? Just go and have a good sandwich\n", "\nWhen you visit UCI's University Village Center on a Sunday morning and realize everything doesn't open until 11AM, but you're starving at 10AM, this is the place to go.\n\nThe staff is helpful and they always recommend their most popular items. My boyfriend and I went with the full 9\" Garlic Chicken Sandwich which is cut in half for easier handling. The bread is crispy and warm and the garlic sauce is creamy. Along with chicken, there were chunks of mushroom and broccoli stuffed in there.\n\nThis kind of sandwich reminds me of something my mom or grandma would make. It's filling and warms my soul. Even only eating half a sandwich, I was content. I wouldn't mind coming back again for more.\n", "\nMmmm I love Le Dip for a cheap but satisfying meal as a college student. All of their sandwiches are so good. My favorite has to be the chicken bacon club. \n\nIt's serving piping hot, and cut in half so you can share with a friend. Their baguette is nice and crispy, filled with chicken, bacon cheese and tomato, it's delicious. Get it with the garlic sauce! It's to die for! The combination is good for breakfast, lunch, and dinner. \n\nIt's hard to beat a place like Le Dip. It'll always be my go-to at UTC.\n", "\nI don't know why this place is rated so highly. They took a really long time to make my food and the french connection was just bread with meat and cheese. It didn't taste good and I don't recommend this place to anyone.\n"]